IRP/src/Enums/GoodsReceiptTransactionTypes/GoodsReceiptTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>GoodsReceiptTransactionTypes</name>
 <enumValues>
  <name>InventoryTransfer</name>
 </enumValues>
 <enumValues>
  <name>Purchase</name>
 </enumValues>
 <enumValues>
  <name>ReturnFromCustomer</name>
 </enumValues>
 <enumValues>
  <name>ReceiptFromConsignor</name>
 </enumValues>
 <enumValues>
  <name>ReturnFromTradeAgent</name>
 </enumValues>
 <enumValues>
  <name>PreliminaryStock</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/GoodsReceiptTransactionTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	ChoiceData = New ValueList();
	ChoiceData.Add(InventoryTransfer);
	ChoiceData.Add(Purchase);
	ChoiceData.Add(ReturnFromCustomer);
	If FOServer.IsUseSimpleBatch() Then
		ChoiceData.Add(PreliminaryStock);
	EndIf;
	
	If FOServer.IsUseCommissionTrading() Then
		ChoiceData.Add(ReceiptFromConsignor);
		ChoiceData.Add(ReturnFromTradeAgent);
	EndIf;	
EndProcedure
